app/views/dynamic_pages/gossip_show.html.erb

      <p>
        <b>Son auteur :</b> <%= @gossip.user.first_name %><br/>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]