app/views/dynamic_pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    <div class="card-body">
      <h5 class="card-title"><b>Auteur :</b> <%= gossip.user.first_name %></h5>