app/views/dynamic_pages/home.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]
---
        <small class="text-muted">Gossip n°<%= gossip.id %></small><p></p>
        <h5 class="card-title"><b>Auteur :</b> <%= gossip.user.first_name %></h5>
        <p class="card-text"><b>Titre :</b> <%= gossip.title %></p>
        <% if gossip.comments.present? %>
          <hr class="style1">
          <p class="card-text text-muted"><b></b> <%= gossip.comments.count %> commentaires</p>