app/views/comments/edit.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
    <h2>Modification du commentaire : </h2>
    <h4><br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<strong>"<%= @comment.content %>"</strong> écrit par <strong><%= @comment.user.first_name %><%= @comment.user.last_name %></strong><h4><br>