app/views/gossips/show.html.erb

            <b>Le contenu du potin :</b> "<%= @gossip.content %>"<br/><br/>
            <b>Son auteur :</b> <%= @gossip.user.first_name %> <%= @gossip.user.last_name %><br/>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

          <div class="card-body">
            <h5 class="card-title"><b></b> <%= comment.user.first_name %> <%= comment.user.last_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]