app/controllers/cities_controller.rb

  def show
    @city = City.find(params[:id])
    @gossips = City.find(params[:id]).gossips
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" INNER JOIN "users" ON "gossips"."user_id" = "users"."id" WHERE "users"."city_id" = $1  [["city_id", 2]]