app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(id: Comment.last.id + 1, content: params[:content], user_id: 11, gossip_id: params[:gossip_id])
    if @comment.save
---
SELECT  "comments".* FROM "comments" ORDER BY "comments"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "comments" ("id", "content", "user_id", "gossip_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 21], ["content", "hello"], ["user_id", 11], ["gossip_id", 2], ["created_at", "2020-02-12 18:16:16.736462"], ["updated_at", "2020-02-12 18:16:16.736462"]]

  def edit
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]

  def update
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])
    if @comment.update(content: params[:content])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "wesh"], ["updated_at", "2020-02-13 09:19:37.738499"], ["id", 25]]

  def destroy
    @gossip = Gossip.find(params[:gossip_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 21]]