app/controllers/dynamic_pages_controller.rb

SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def home
    @gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def gossip_show
    @gossip = Gossip.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
---
  def user_show
    @user = User.find(params[:id])