app/controllers/gossips_controller.rb

  def create
    @gossip = Gossip.new(id: Gossip.last.id + 1, title: params[:title], content: params[:content], user_id: current_user.id) # avec xxx qui sont les données obtenues à partir du formulaire

    if @gossip.save # essaie de sauvegarder en base @gossip
---
SELECT  "gossips".* FROM "gossips" ORDER BY "gossips"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("id", "title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 21], ["title", "Josselin moche"], ["content", "Josselin est moche"], ["user_id", 11], ["created_at", "2020-02-12 11:55:27.862882"], ["updated_at", "2020-02-12 11:55:27.862882"]]

  def edit
    @gossip = Gossip.find(params[:id])
    if current_user.id == @gossip.user.id
      @gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    @gossip = Gossip.find(params[:id])
    if current_user.id == @gossip.user.id
      if @gossip.update(title: params[:title], content: params[:content])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "Hello"], ["content", "Hello world"], ["updated_at", "2020-02-12 15:06:35.509088"], ["id", 1]]

  def destroy
    @gossip = Gossip.find(params[:id])
    if current_user.id == @gossip.user.id
      @gossip.destroy
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 21]]