app/views/cities/show.html.erb

        <small class="text-muted">Gossip n°<%= gossip.id %></small><p></p>
        <h5 class="card-title"><b>Auteur :</b> <%= gossip.user.first_name %></h5>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

        <hr class="style1">
        <p class="card-text text-muted"><b></b> <%= gossip.comments.count %> commentaires</p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."gossip_id" = $1  [["gossip_id", 2]]